app/controllers/directives_controller.rb

SELECT "directives".* FROM "directives" INNER JOIN "directive_users" ON "directives".id = "directive_users".directive_id WHERE (("directive_users".user_id = 4))
SELECT "tags".* FROM "tags" INNER JOIN "taggings" ON "tags".id = "taggings".tag_id WHERE (("taggings".taggable_id = 16) AND ("taggings".taggable_type = 'Directive'))
SELECT * FROM "directives"
---
  def index
    @page_title = "Directives"

    if params["tag_list"]
      @tags = params["tag_list"].reject{|t| t[1] == "0"}.map(&:first)
      @match_all = params["match_all"] == "1"
      @directives = Directive.find_tagged_with(@tags, :match_all => @match_all)
    else
      @directives = Directive.all

SELECT * FROM "directives" WHERE ("directives"."id" = 1)
---
  def show
    @directive = Directive.find(params[:id])

SELECT * FROM "directives" WHERE ("directives"."id" = 8)
---
  def edit
    @directive = Directive.find(params[:id])

SELECT * FROM "directives" WHERE ("directives"."id" = 8)
---
  def update
    @directive = Directive.find(params[:id])

SELECT * FROM "directives" WHERE ("directives"."id" = 6)
DELETE FROM "directives" WHERE "id" = 6
---
  def destroy
    @directive = Directive.find(params[:id])
    @directive.destroy

SELECT * FROM "directive_users" WHERE ("directive_users"."kind" = 'flag')
---
  def admin
    render_404 unless @current_user.admin?
    @flags = DirectiveUser.find_all_by_kind("flag")